import '../models/ayat_al_kursi_model.dart';

class AyatAlKursiLocalDataSource {
  static AyatAlKursiModel get ayatulKursi {
    return AyatAlKursiModel(
      textAr: "اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      textEn: "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep.\n\nTo Him belongs whatever is in the heavens and whatever is on the earth.\n\nWho is it that can intercede with Him except by His permission?\n\nHe knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills.\n\nHis Kursi extends over the heavens and the earth, and their preservation tires Him not.\n\nAnd He is the Most High, the Most Great.",
      titleAr: "ايه الكرسي - البقره 255",
      tafsirAlMuyassar: "الله الذي لا يستحق الألوهية والعبودية إلا هو، الحيُّ الذي له جميع معاني الحياة الكاملة كما يليق بجلاله، القائم على كل شيء، لا تأخذه سِنَة أي: نعاس، ولا نوم، كل ما في السماوات وما في الأرض ملك له، ولا يتجاسر أحد أن يشفع عنده إلا بإذنه، محيط علمه بجميع الكائنات ماضيها وحاضرها ومستقبلها، يعلم ما بين أيدي الخلائق من الأمور المستقبلة، وما خلفهم من الأمور الماضية، ولا يَطَّلعُ أحد من الخلق على شيء من علمه إلا بما أعلمه الله وأطلعه عليه. وسع كرسيه السماوات والأرض، ولا يعلم كيفيته إلا الله سبحانه، ولا يثقله سبحانه حفظهما، وهو العلي بذاته وصفاته على جميع مخلوقاته، الجامع لجميع صفات العظمة والكبرياء. وهذه الآية أعظم آية في القرآن.",
      mukhtasar: "الله الذي لا إله يُعبد بحقٍّ إلا هو وحده دون سواه، الحي حياة كاملة لا موت فيها ولا نقص، القيوم الذي قام بنفسه فاستغنى عن جميع خلقه، وبه قامت جميع المخلوقات فلا تستغني عنه في كل أحوالها، لا يأخذه نعاس ولا نوم؛ لكمال حياته وقيوميته، له وحده ملك ما في السماوات وما في الأرض، لا يملك أحد أن يشفع عنده لأحد إلا بعد إذنه ورضاه، يعلم ما مضى من أمور خلقه مما وقع، وما يستقبلونه مما لم يقع، ولا يحيطون بشيء من علمه تعالى إلا بما شاء أن يطلعهم عليه، أحاط كرسيه بالسماوات والأرض على سَعَتِهما وعِظَمِهما، ولا يُثْقِلُه أو يشق عليه حفظهما، وهو العَليُّ بذاته وقَدْرِه وقَهْرِه، العظيم في ملكه وسلطانه.",
      benefits: [
        const RichTextData(text: "قرأه ايه الكرسي بعد كل صلاه , يجعل بينك وبين الجنه الموت فقط\nفعن أبي أمامة عن النبي - صلى الله عليه وسلم- قال: "),
        const RichTextData(text: "(مَنْ قرأَ آيةً الكُرسِيِّ دُبُرَ كلِّ صلاةٍ مكتوبةٍ، لمْ يمنعْهُ من دُخُولِ الجنةَ إلَّا أنْ يمُوتَ)", isHighlight: true),
        const RichTextData(text: "\n\nوقرأتها عند النوم هي سنه نبويه ثابته\nويحفظ الله العبد من الشيطان فلا يقربه حتي يصبح الصباح\n\nاستند هذا الفضل إلى حديث صحيح رواه أبو هريرة رضي الله عنه عن النبي صلى الله عليه وسلم، حيث قال الشيطان: "),
        const RichTextData(text: "\"إذا أويت إلى فراشك فاقرأ آية الكرسي... لن يزال عليك من الله حافظ، ولا يقربك شيطان حتى تصبح\"", isHighlight: true),
        const RichTextData(text: "، فصدّق النبي صلى الله عليه وسلم قوله ووصف الشيطان بأنه كذوب."),
      ],
      story: [
        const RichTextData(text: "كان من سُنَّة رسول الله صلى الله عليه وسلم أن يقرأ آية الكرسي قبل نومه، وهي الآية الحافظة من الشيطان، وقد عرفنا هذا الحفظ من قصة جميلة حدثت لأبي هريرة رضي الله عنه؛ فقد روى البخاري عَنْه أنه قَالَ: وَكَّلَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم بِحِفْظِ زَكَاةِ رَمَضَانَ، فَأَتَانِي آتٍ فَجَعَلَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ، وَقُلْتُ: وَاللَّهِ لأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم.\n\nقَالَ: إِنِّي مُحْتَاجٌ، وَعَلَيَّ عِيَالٌ وَلِي حَاجَةٌ شَدِيدَةٌ. قَالَ: فَخَلَّيْتُ عَنْهُ، فَأَصْبَحْتُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم: "),
        const RichTextData(text: "\"يَا أَبَا هُرَيْرَةَ، مَا فَعَلَ أَسِيرُكَ البَارِحَةَ؟\"", isHighlight: true),
        const RichTextData(text: "، قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ، شَكَا حَاجَةً شَدِيدَةً، وَعِيَالًا، فَرَحِمْتُهُ، فَخَلَّيْتُ سَبِيلَهُ. قَالَ: "),
        const RichTextData(text: "\"أَمَا إِنَّهُ قَدْ كَذَبَكَ، وَسَيَعُودُ\".", isHighlight: true),
        const RichTextData(text: "\n\nفَعَرَفْتُ أَنَّهُ سَيَعُودُ، لِقَوْلِ رَسُولِ اللَّهِ صلى الله عليه وسلم: إِنَّهُ سَيَعُودُ. فَرَصَدْتُهُ، فَجَاءَ يَحْثُو مِنَ الطَّعَامِ، فَأَخَذْتُهُ، فَقُلْتُ: لأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم. قَالَ: دَعْنِي فَإِنِّي مُحْتَاجٌ وَعَلَيَّ عِيَالٌ، لاَ أَعُودُ. فَرَحِمْتُهُ، فَخَلَّيْتُ سَبِيلَهُ، فَأَصْبَحْتُ، فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم: "),
        const RichTextData(text: "\"يَا أَبَا هُرَيْرَةَ، مَا فَعَلَ أَسِيرُكَ؟\"", isHighlight: true),
        const RichTextData(text: "، قُلْتُ: يَا رَسُولَ اللَّهِ شَكَا حَاجَةً شَدِيدَةً، وَعِيَالًا، فَرَحِمْتُهُ، فَخَلَّيْتُ سَبِيلَهُ. قَالَ: "),
        const RichTextData(text: "\"أَمَا إِنَّهُ قَدْ كَذَبَكَ وَسَيَعُودُ\".", isHighlight: true),
        const RichTextData(text: "\n\nفَرَصَدْتُهُ الثَّالِثَةَ، فَجَاءَ يَحْثُو مِنَ الطَّعَامِ، فَأَخَذْتُهُ، فَقُلْتُ: لأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ، وَهَذَا آخِرُ ثَلاَثِ مَرَّاتٍ، أَنَّكَ تَزْعُمُ لاَ تَعُودُ، ثُمَّ تَعُودُ. قَالَ: دَعْنِي أُعَلِّمْكَ كَلِمَاتٍ يَنْفَعُكَ اللَّهُ بِهَا. قُلْتُ: مَا هُوَ؟ قَالَ: إِذَا أَوَيْتَ إِلَى فِرَاشِكَ، فَاقْرَأْ آيَةَ الكُرْسِيِّ: "),
        const RichTextData(text: "{اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الحَيُّ القَيُّومُ} [البقرة: 255]", isHighlight: true),
        const RichTextData(text: "، حَتَّى تَخْتِمَ الآيَةَ، فَإِنَّكَ لَنْ يَزَالَ عَلَيْكَ مِنَ اللَّهِ حَافِظٌ، وَلاَ يَقْرَبَنَّكَ شَيْطَانٌ حَتَّى تُصْبِحَ. فَخَلَّيْتُ سَبِيلَهُ، فَأَصْبَحْتُ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم: "),
        const RichTextData(text: "\"مَا فَعَلَ أَسِيرُكَ البَارِحَةَ؟\"", isHighlight: true),
        const RichTextData(text: "، قُلْتُ: يَا رَسُولَ اللَّهِ، زَعَمَ أَنَّهُ يُعَلِّمُنِي كَلِمَاتٍ يَنْفَعُنِي اللَّهُ بِهَا، فَخَلَّيْتُ سَبِيلَهُ. قَالَ: "),
        const RichTextData(text: "\"مَا هِيَ؟\"", isHighlight: true),
        const RichTextData(text: "، قُلْتُ: قَالَ لِي: إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الكُرْسِيِّ مِنْ أَوَّلِهَا حَتَّى تَخْتِمَ الآيَةَ: "),
        const RichTextData(text: "{اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الحَيُّ القَيُّومُ} [البقرة: 255]", isHighlight: true),
        const RichTextData(text: "، وَقَالَ لِي: لَنْ يَزَالَ عَلَيْكَ مِنَ اللَّهِ حَافِظٌ، وَلاَ يَقْرَبَكَ شَيْطَانٌ حَتَّى تُصْبِحَ. -وَكَانُوا أَحْرَصَ شَيْءٍ عَلَى الخَيْرِ- فَقَالَ النَّبِيُّ صلى الله عليه وسلم: "),
        const RichTextData(text: "\"أَمَا إِنَّهُ قَدْ صَدَقَكَ وَهُوَ كَذُوبٌ، تَعْلَمُ مَنْ تُخَاطِبُ مُنْذُ ثَلاَثِ لَيَالٍ يَا أَبَا هُرَيْرَةَ؟\"", isHighlight: true),
        const RichTextData(text: ". قَالَ: لاَ. قَالَ: "),
        const RichTextData(text: "\"ذَاكَ شَيْطَانٌ\".", isHighlight: true),
      ],
    );
  }
}
